<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of SD Clone.</string>
    <key>Identifier</key>
    <string>com.github.jaharmi.download.SDClone</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SD Clone</string>
        <key>DISPLAY_NAME</key>
        <string>SD Clone</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://www.twocanoes.com/sd-clone/updates/sd-clone3-software-updates.xml</string>
        <key>PRODUCT_DOWNLOAD_URL</key>
        <string>https://www.twocanoes.com/products/mac/sd-clone</string>
<!--
        https://tc-downloads.s3.amazonaws.com/SDClone3_0.dmg
        <a href="//tc-downloads.s3.amazonaws.com/SDClone3_0.dmg" class="pure-button pure-button-primary clicky_log_download">Download Now</a>
 -->
        <key>PRODUCT_DOWNLOAD_PATTERN</key>
		<string>.a href="//(tc-downloads.s3.amazonaws.com/SDClone\d+_\d+.dmg)".+./a.</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
                <key>appcast_request_headers</key>
                <dict>
                    <key>User-Agent</key>
                	<string>SD Clone/3.0 Sparkle/0b186dc</string>
                </dict>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%PRODUCT_DOWNLOAD_PATTERN%</string>
				<key>url</key>
				<string>%PRODUCT_DOWNLOAD_URL%</string>
                <key>request_headers</key>
                <dict>
                    <key>User-Agent</key>
                	<string>SD Clone/3.0 Sparkle/0b186dc</string>
                </dict>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
				<key>url</key>
				<string>https://%match%</string>
                <key>request_headers</key>
                <dict>
                    <key>User-Agent</key>
                	<string>SD Clone/3.0 Sparkle/0b186dc</string>
                </dict>
            </dict>
        </dict>

        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%DISPLAY_NAME%.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Twocanoes Software, Inc.</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
<!--
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%DISPLAY_NAME%/Applications</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>/Applications/%DISPLAY_NAME%.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.twocanoes.SD-Clone" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UXP6YEHSPW)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
 -->
    </array>
</dict>
</plist>
