<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of DEVON Technologies' freeware CalcService.</string>
    <key>Identifier</key>
    <string>com.github.jaharmi.download.DEVONTechnologies.CalcService</string>
    <key>ParentRecipe</key>
    <string>com.github.jaharmi.download.DEVONTechnologies.Freeware</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CalcService</string>
        <key>PRODUCT_RE_PATTERN</key>
        <string>href="(https://download\.devontechnologies\.com/download/freeware/calcservice/[\d\.]+/CalcService\.app\.zip)"</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%PRODUCT_DOWNLOAD_URL%</string>
                <key>re_pattern</key>
                <string>%PRODUCT_RE_PATTERN%</string>
                <key>result_output_var_name</key>
                <string>devon_freeware_download</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%devon_freeware_download%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/CalcService.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
