<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Jenkins CI.</string>
	<key>Identifier</key>
	<string>com.github.jaharmi.download.JenkinsCI</string>
	<key>Input</key>
	<dict>
		<key>PRODUCT_DOWNLOAD_URL</key>
		<string>http://mirrors.jenkins-ci.org/osx/latest</string>
		<key>NAME</key>
		<string>Jenkins CI</string>
		<key>VERSION_DOWNLOAD_URL</key>
		<string>https://jenkins-ci.org/</string>
		<key>VERSION_RE_PATTERN</key>
		<string>.strong.\nLatest:\n(\d+.\d+)\n.\/strong.</string>
<!-- 
        https://jenkins-ci.org
        http://mirrors.jenkins-ci.org/osx/latest
<strong>
Latest:
1.646
</strong>
 -->
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%VERSION_RE_PATTERN%</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>%VERSION_DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%PRODUCT_DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>jenkins-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
