<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of ripgrep.</string>
	<key>Identifier</key>
	<string>com.github.jaharmi.download.ripgrep</string>
	<key>Input</key>
	<dict>
		<key>%ASSET_REGEX%</key>
		<string>-apple-darwin.tar.gz$</string>
		<!-- valid options for mac are x86_64 or aarch64 for Apple Silicon -->
		<key>ARCH</key>
		<string>aarch64</string>
		<key>GITHUB_REPO</key>
		<string>BurntSushi/ripgrep</string>
		<key>NAME</key>
		<string>ripgrep</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>^.*%ARCH%%ASSET_REGEX%</string>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.tar.gz</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
