<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of HyperDither.</string>
	<key>Identifier</key>
	<string>com.github.jaharmi.download.HyperDither</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>HyperDither</string>
		<key>DEPRECATION_REASON</key>
		<string>The app is apparently available only in the Mac App Store. See Issue #68.</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Recipes related to %NAME% have been retired. %DEPRECATION_REASON%</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
	</array>
</dict>
</plist>
