<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of audio|acacia:server.</string>
	<key>Identifier</key>
	<string>com.github.jaharmi.download.audio|acacia:server</string>
	<key>Input</key>
	<dict>
		<key>PRODUCT_DOWNLOAD_URL</key>
		<string>https://www.plethra.com/downloads/</string>
		<key>NAME</key>
		<string>audio|acacia:server</string>
		<key>PRODUCT_RE_PATTERN</key>
		<string>.a href="(http://install.plethra.com/prelude/macamd64/audio-acacia.pkg)"</string>
<!-- 
        <a href="http://install.plethra.com/prelude/macamd64/audio-acacia.pkg">Mac OS X - Intel (32-bit &amp; 64-bit)</a>
		http://install.plethra.com/prelude/macamd64/audio-acacia.pkg
 -->
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%PRODUCT_RE_PATTERN%</string>
				<key>result_output_var_name</key>
				<string>FILE_DOWNLOAD_URL</string>
				<key>url</key>
				<string>%PRODUCT_DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%FILE_DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
