<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of oMLX.</string>
	<key>Identifier</key>
	<string>com.github.jaharmi.download.oMLX</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>oMLX</string>
		<key>DOWNLOAD_OS_PATTERN</key>
		<string>macos(15|26)-(sequoia|tahoe)</string>
		<key>DOWNLOAD_REGEX</key>
		<string>oMLX.*-%DOWNLOAD_OS_PATTERN%\.dmg$</string>
		<key>ASSET_URL_OS_PATTERN</key>
		<string>\/oMLX-.*-(%DOWNLOAD_OS_PATTERN%)\.dmg$</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>%DOWNLOAD_REGEX%</string>
				<key>github_repo</key>
				<string>jundot/omlx</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>result_output_var_name</key>
				<string>ASSET_OS</string>
				<key>re_pattern</key>
				<string>%ASSET_URL_OS_PATTERN%</string>
				<key>text_in</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.jazzace.processors/TextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%-%ASSET_OS%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/oMLX.app</string>
				<key>requirement</key>
				<string>identifier "com.omlx.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PSK5Q5T46L</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/oMLX.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
