<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of HyperDock.</string>
	<key>Identifier</key>
	<string>com.github.jaharmi.download.HyperDock</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>HyperDock</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://bahoom.com/hyperdock/appcast.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>%SPARKLE_FEED_URL%</string>
			</dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <!--
        Temporary workaround for CodeSignatureVerifier limitation. Copy prefPane to app.
        Remove Copier when no longer necessary.
         -->
        <dict>
        	<key>Arguments</key>
        	<dict>
        	    <key>destination_path</key>
        	    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.app</string>
        	    <key>source_path</key>
        	    <string>%pathname%/%NAME%.prefpane</string>
        	</dict>
        	<key>Processor</key>
        	<string>Copier</string>
        </dict>
        <!--
        Change back from app to prefPane when that is supported.
         -->
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "de.bahoom.HyperDock.prefpane" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4EA894RLMQ")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
        <!--
        Remove PathDeleter when prefPane verification is supported.
         -->
        <dict>
        	<key>Arguments</key>
        	<dict>
        	    <key>path_list</key>
        	    <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.app</string>
        	    </array>
        	</dict>
        	<key>Processor</key>
        	<string>PathDeleter</string>
        </dict>
	</array>
</dict>
</plist>
