<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Safari Technology Preview and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jaharmi.munki.SafariTechnologyPreview</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>SafariTechnologyPreview</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Safari Technology Preview gives you an early look at upcoming web technologies in OS X and iOS. Get the latest layout technologies, visual effects, developer tools, and more, so you can provide input on how they are implemented and deliver a best-in-class user experience on all Apple devices.</string>
			<key>developer</key>
			<string>Apple</string>
			<key>display_name</key>
			<string>Safari Technology Preview</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jaharmi.download.SafariTechnologyPreview</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
                <string>%pathname%/%DISPLAY_NAME%*.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
