<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Safari Technology Preview.</string>
	<key>Identifier</key>
	<string>com.github.jaharmi.download.SafariTechnologyPreview</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SafariTechnologyPreview</string>
		<key>DISPLAY_NAME</key>
		<string>Safari Technology Preview</string>
		<key>DOWNLOAD_URL</key>
		<string>http://appldnld.apple.com/STP/SafariTechnologyPreview.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
			    <key>url</key>
			    <string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/%DISPLAY_NAME%*.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Software Update</string>
                    <string>Apple Software Update Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
