<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of BoinxTV.</string>
    <key>Identifier</key>
    <string>com.github.jaharmi.download.BoinxTV</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BoinxTV</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://sparkle.boinx.com/appcast.lasso</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
                <key>appcast_query_pairs</key>
                <dict>
                    <key>appName</key>
                    <string>%NAME%</string>
                    <key>lang</key>
                    <string>en</string>
                    <key>appID</key>
                    <string>BXTV</string>
                    <key>versionString</key>
                    <string>1.0</string>
                    <key>locale</key>
                    <string>en_US</string>
                    <key>feedtype</key>
                    <string>1</string>
                </dict>
                <key>appcast_request_headers</key>
                <dict>
                    <key>User-Agent</key>
                    <string>curl/7.43.0</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>request_headers</key>
                <dict>
                    <key>User-Agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/39.0.2171.95 Safari/537.36</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
