<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Installs the current release version of the Olympus A-GPS Utility software.</string>
    <key>Identifier</key>
    <string>com.github.jaharmi.install.Olympus.A-GPSUtility</string>
    <key>ParentRecipe</key>
    <string>com.github.jaharmi.download.Olympus.A-GPSUtility</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OLYMPUS A-GPS Utility</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
				<string>%pathname%/OlympusAGPSUtility_v*.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
