<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of the Olympus A-GPS Utility software.</string>
    <key>Identifier</key>
    <string>com.github.jaharmi.download.Olympus.A-GPSUtility</string>
    <key>Input</key>
    <dict>
        <key>olympus_agps_utility_downloads_url</key>
        <string>http://sdl.olympus-imaging.com/agps/index.en.html</string>
        <key>olympus_agps_utility_product_pattern</key>
        <string>/agps/data/AGPSUtilSetup_v\d+.dmg</string>
        <key>NAME</key>
        <string>OLYMPUS A-GPS Utility</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%olympus_agps_utility_downloads_url%</string>
                <key>re_pattern</key>
                <string>%olympus_agps_utility_product_pattern%</string>
                <key>result_output_var_name</key>
                <string>olympus_agps_utility_download_path</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://sdl.olympus-imaging.com%olympus_agps_utility_download_path%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Olympus Corporation (4H9BLQ3JFD)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/OlympusAGPSUtility_v*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
    </array>
</dict>
</plist>
