<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Installs the latest version of Manuscripts.</string>
	<key>Identifier</key>
	<string>com.github.jaharmi.install.Manuscripts</string>
	<key>ParentRecipe</key>
	<string>com.github.jaharmi.download.Manuscripts</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Manuscripts</string>
		<key>DEPRECATION_REASON</key>
		<string>Download links and update feeds appear to redirect to an unrelated site. See Issue #63.</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Recipes related to %NAME% have been retired. %DEPRECATION_REASON%</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
	</array>
</dict>
</plist>
