<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest release version of PCKeyboardHack and imports into a Munki repository.</string>
    <key>Identifier</key>
    <string>com.github.jaharmi.munki.PCKeyboardHack</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PCKeyboardHack</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Tekezo</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>PCKeyboardHack can change caps lock key behavior. For example, changing caps lock key to delete Key. PCKeyboardHack can activate International Keys on Non-Apple keyboard.</string>
            <key>display_name</key>
            <string>Tekezo PCKeyboardHack</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>RestartAction</key>
            <string>RequireRestart</string>
            <key>supported_architectures</key>
            <array>
               <string>i386</string>
               <string>x86_64</string>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jaharmi.download.PCKeyboardHack</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>