<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of LM Studio and uploads to Fleet (direct mode) or S3+GitOps (GitOps mode).</string>
	<key>Identifier</key>
	<string>com.github.jaharmi.fleet.LMStudio</string>
	<key>Input</key>
	<dict>
		<key>FLEET_GITOPS_SOFTWARE_DIR</key>
		<string>lib/macos/software</string>
		<key>FLEET_GITOPS_TEAM_YAML_PATH</key>
		<string>teams/workstations.yml</string>
		<key>ICON</key>
		<string>%NAME%.png</string>
		<key>INSTALL_SCRIPT</key>
		<string></string>
		<key>NAME</key>
		<string>LM Studio</string>
		<key>POST_INSTALL_SCRIPT</key>
		<string></string>
		<key>PRE_INSTALL_QUERY</key>
		<string></string>
		<key>UNINSTALL_SCRIPT</key>
		<string></string>
		<key>automatic_install</key>
		<false/>
		<key>categories</key>
		<array>
			<string>Productivity</string>
		</array>
		<key>gitops_mode</key>
		<false/>
		<key>labels_exclude_any</key>
		<array/>
		<key>labels_include_any</key>
		<array/>
		<key>s3_retention_versions</key>
		<integer>0</integer>
		<key>self_service</key>
		<true/>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.jaharmi.pkg.LMStudio</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>aws_access_key_id</key>
				<string>%AWS_ACCESS_KEY_ID%</string>
				<key>aws_cloudfront_domain</key>
				<string>%AWS_CLOUDFRONT_DOMAIN%</string>
				<key>aws_default_region</key>
				<string>%AWS_DEFAULT_REGION%</string>
				<key>aws_s3_bucket</key>
				<string>%AWS_S3_BUCKET%</string>
				<key>aws_secret_access_key</key>
				<string>%AWS_SECRET_ACCESS_KEY%</string>
				<key>fleet_api_base</key>
				<string>%FLEET_API_BASE%</string>
				<key>fleet_api_token</key>
				<string>%FLEET_API_TOKEN%</string>
				<key>github_token</key>
				<string>%FLEET_GITOPS_GITHUB_TOKEN%</string>
				<key>gitops_repo_url</key>
				<string>%FLEET_GITOPS_REPO_URL%</string>
				<key>gitops_software_dir</key>
				<string>%FLEET_GITOPS_SOFTWARE_DIR%</string>
				<key>gitops_team_yaml_path</key>
				<string>%FLEET_GITOPS_TEAM_YAML_PATH%</string>
				<key>icon</key>
				<string>%ICON%</string>
				<key>install_script</key>
				<string>%INSTALL_SCRIPT%</string>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>post_install_script</key>
				<string>%POST_INSTALL_SCRIPT%</string>
				<key>pre_install_query</key>
				<string>%PRE_INSTALL_QUERY%</string>
				<key>software_title</key>
				<string>%NAME%</string>
				<key>team_id</key>
				<string>%FLEET_TEAM_ID%</string>
				<key>uninstall_script</key>
				<string>%UNINSTALL_SCRIPT%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.fleet.FleetImporter/FleetImporter</string>
		</dict>
	</array>
</dict>
</plist>
