<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of LM Studio and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.jaharmi.pkg.LMStudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LM Studio</string>
		<key>PKG_BUNDLE_ID</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.almenscorner.download.LMStudio</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>+</string>
				<key>input_string</key>
				<string>%version%</string>
				<key>replace</key>
				<string>.</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>bundleid</key>
				<string>%PKG_BUNDLE_ID%</string>
				<key>version</key>
				<string>%output_string%</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
