<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Emacs.</string>
	<key>Identifier</key>
	<string>com.github.jaharmi.download.Emacs</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Emacs</string>
		<key>ASSET_ARCH_PATTERN</key>
		<string>(?P&lt;asset_arch&gt;arm64|x86_64)</string>
		<key>ASSET_URL_VERSION_PATTERN</key>
		<string>\/Emacs-(?P&lt;version&gt;[\.\d]+)[-\w]*\/</string>
		<key>ASSET_REGEX_PATTERN</key>
		<string>.*%ASSET_ARCH_PATTERN%\.dmg$</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>%ASSET_REGEX_PATTERN%</string>
				<key>github_repo</key>
				<string>jimeh/emacs-builds</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>result_output_var_name</key>
				<string>asset_arch</string>
				<key>re_pattern</key>
				<string>%ASSET_ARCH_PATTERN%</string>
				<key>text_in</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.jazzace.processors/TextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>re_pattern</key>
				<string>%ASSET_URL_VERSION_PATTERN%</string>
				<key>text_in</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.jazzace.processors/TextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%-%asset_arch%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Emacs.app</string>
				<key>requirement</key>
				<string>identifier "org.gnu.Emacs" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5HX66GF82Z"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
				<key>app_url_version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>FALSEPREDICATE</string>
				<key>app_bundleid</key>
				<string>%bundleid%</string>
				<key>app_bundle_version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
	</array>
</dict>
</plist>
