<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest release version of Divvy and imports into a Munki repository.</string>
    <key>Identifier</key>
    <string>com.github.jaharmi.munki.Divvy</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Divvy</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Mizage</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>
Divvy is an entirely new way of managing your workspace. It allows you to quickly and efficiently “divvy up” your screen into exact portions.

With Divvy, it’s as simple as a single click and drag in the Divvy interface and your window will be resized and moved to a relative portion of the screen. If that seems like too much work, you can go ahead and create as many different shortcuts as you’d like that resize and move your windows.

Divvy is designed to be quick, simple and elegant. We want it to stay out of your way as much as possible while providing the most powerful window management available today.
    </string>
            <key>display_name</key>
            <string>Mizage Divvy</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>supported_architectures</key>
			<array>
			   <string>i386</string>
			   <string>x86_64</string>
			</array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jaharmi.download.Divvy</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%dmg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array></dict>
</plist>
