<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Nvidia Quadro-Certified and GeForce Web Driver.</string>
	<key>Identifier</key>
	<string>com.github.jaharmi.download.Nvidia.WebDriverQuadroCertified</string>
	<key>Input</key>
	<dict>
		<key>PRODUCT_DOWNLOAD_URL</key>
		<string>https://gfe.nvidia.com/mac-update</string>
		<key>NAME</key>
		<string>Nvidia Mac Quadro-Certified and GeForce Web Driver</string>
		<key>PRODUCT_RE_PATTERN</key>
		<string>(https://images\.nvidia\.com/mac/pkg/\d+/WebDriver-[\d\.f]+\.pkg)</string>
<!--
        https://gfe.nvidia.com/mac-update
        <key>downloadURL</key>
        <string>http://us.download.nvidia.com/Mac/Quadro_Certified/346.03.05f01/WebDriver-346.03.05f01.pkg</string>
 -->
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%PRODUCT_RE_PATTERN%</string>
				<key>result_output_var_name</key>
				<string>FILE_DOWNLOAD_URL</string>
				<key>url</key>
				<string>%PRODUCT_DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%FILE_DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: NVIDIA Corporation</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
