<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Input</key>
    <dict>
        <key>IDENTIFIER</key>
        <string>com.github.autopkg.munki.SourceTree</string>
        <key>NAME</key>
        <string>SourceTree</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/SourceTree</string>
        <key>SU_FEED_URL</key>
        <string>https://www.sourcetreeapp.com/update/SparkleAppcast.xml</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Say goodbye to the command line – use the full capability of Git and Mercurial in the SourceTree desktop app. Manage all your repositories, hosted or local, through SourceTree's simple interface.</string>
            <key>display_name</key>
            <string>Atlassian SourceTree</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
			<key>items_to_copy</key>
			<array>
				<dict>
					<key>destination_path</key>
					<string>/Applications</string>
					<key>source_item</key>
					<string>SourceTree.app</string>
					<key>user</key>
					<string>root</string>
					<key>group</key>
					<string>wheel</string>
					<key>mode</key>
					<string>go-w</string>
				</dict>
			</array>
			<key>supported_architectures</key>
			<array>
			   <string>i386</string>
			   <string>x86_64</string>
			</array>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SU_FEED_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
