<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Aleph One for Marathon Infinity.</string>
    <key>Identifier</key>
    <string>com.github.jaharmi.download.AlephOne.MarathonInfinity</string>
    <key>ParentRecipe</key>
    <string>com.github.jaharmi.download.AlephOne</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Aleph One Marathon Infinity</string>
        <key>marathon_version</key>
        <string>infinity</string>
        <key>marathon_app</key>
        <string>Marathon Infinity</string>
        <key>marathon_version_file</key>
        <string>MarathonInfinity</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
    </array>
</dict>
</plist>