<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Myth from Project Magma. Choose which Myth version to get.</string>
    <key>Identifier</key>
    <string>com.github.jaharmi.download.ProjectMagma</string>
    <key>Input</key>
    <dict>
        <key>PRODUCT_DOWNLOAD_URL</key>
        <string>https://projectmagma.net/downloads</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%PRODUCT_DOWNLOAD_URL%</string>
                <key>re_pattern</key>
                <string>%PRODUCT_DIRECTORY_RE_PATTERN%</string>
                <key>result_output_var_name</key>
                <string>PRODUCT_DIRECTORY</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%PRODUCT_DOWNLOAD_URL%</string>
                <key>re_pattern</key>
                <string>%PRODUCT_VERSION_RE_PATTERN%</string>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%PRODUCT_DOWNLOAD_URL%/%PRODUCT_DIRECTORY%</string>
                <key>re_pattern</key>
                <string>%PRODUCT_RE_PATTERN%</string>
                <key>result_output_var_name</key>
                <string>PRODUCT_DOWNLOAD</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%PRODUCT_DOWNLOAD%</string>
                <key>filename</key>
                <string>%PRODUCT_DIRECTORY%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%PRODUCT_DIRECTORY%.dmg/%PRODUCT_NAME% %version% Installer.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
