<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Myth II: Soulblighter from Project Magma.</string>
    <key>Identifier</key>
    <string>com.github.jaharmi.download.ProjectMagma.Myth2</string>
    <key>ParentIdentifier</key>
    <string>com.github.jaharmi.download.ProjectMagma</string>
    <key>Input</key>
    <dict>
        <key>PRODUCT_NAME</key>
        <string>Myth II</string>
        <key>PRODUCT_DISPLAY_NAME</key>
        <string>%PRODUCT_NAME%: Soulblighter</string>
        <key>PRODUCT_DIRECTORY_RE_PATTERN</key>
        <string>.a href="(myth2_\d+)".Myth II \d+.\d+.\d+./a.</string>
        <key>PRODUCT_VERSION_RE_PATTERN</key>
        <string>.a href="myth2_\d+">%PRODUCT_NAME% (\d+.\d+.\d+)./a.</string>
        <key>PRODUCT_RE_PATTERN</key>
        <string>.a href="(http://tain.totalcodex.net/items/download/myth-ii-.+-mac-os-x)">Mac OS X Installer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
    </array>
</dict>
</plist>
